REGIONS = {
    "northern_region": "ภาคเหนือ",
    "northeastern_region": "ภาคตะวันออกเฉียงเหนือ",
    "central_region": "ภาคกลาง",
    "eastern_region": "ภาคตะวันออก",
    "western_region": "ภาคตะวันตก",
    "southern_region": "ภาคใต้",
}


PROVINCES = {
    "northern_region": {
        "Chiang Mai": {
            "name": "เชียงใหม่",
            "lat": 18.856693467336683,
            "long": 98.91724120603014,
        },
        "Chiang Rai": {"name": "เชียงราย", "lat": 19.88275, "long": 99.91875},
        "Lampang": {
            "name": "ลำปาง",
            "lat": 18.34003092783505,
            "long": 99.50170103092783,
        },
        "Lamphun": {"name": "ลำพูน", "lat": 18.34647058823529, "long": 98.9588431372549},
        "Mae Hong Son": {
            "name": "แม่ฮ่องสอน",
            "lat": 18.753977272727276,
            "long": 98.0533181818182,
        },
        "Nan": {"name": "น่าน", "lat": 18.879818181818184, "long": 100.80723232323233},
        "Phayao": {
            "name": "พะเยา",
            "lat": 19.28782608695652,
            "long": 100.09402898550724,
        },
        "Phrae": {"name": "แพร่", "lat": 18.161846153846152, "long": 100.0986282051282},
        "Uttaradit": {
            "name": "อุตรดิตถ์",
            "lat": 17.6394776119403,
            "long": 100.32702985074629,
        },
    },
    "northeastern_region": {
        "Amnat Charoen": {
            "name": "อำนาจเจริญ",
            "lat": 15.85805357142857,
            "long": 104.70694642857144,
        },
        "Bueng Kan": {
            "name": "บึงกาฬ",
            "lat": 18.158641509433963,
            "long": 103.6755283018868,
        },
        "Buri Ram": {
            "name": "บุรีรัมย์",
            "lat": 14.891285714285717,
            "long": 102.9727671957672,
        },
        "Chaiyaphum": {
            "name": "ชัยภูมิ",
            "lat": 15.975483870967745,
            "long": 101.93707258064516,
        },
        "Kalasin": {
            "name": "กาฬสินธุ์",
            "lat": 16.589940298507464,
            "long": 103.61339552238806,
        },
        "Khon Kaen": {
            "name": "ขอนแก่น",
            "lat": 16.35478606965174,
            "long": 102.5971144278607,
        },
        "Loei": {"name": "เลย", "lat": 17.41151111111111, "long": 101.64483333333334},
        "Maha Sarakham": {
            "name": "มหาสารคาม",
            "lat": 15.991835820895522,
            "long": 103.18694776119402,
        },
        "Mukdahan": {
            "name": "มุกดาหาร",
            "lat": 16.538924528301887,
            "long": 104.5612641509434,
        },
        "Nakhon Phanom": {
            "name": "นครพนม",
            "lat": 17.31197894736842,
            "long": 104.48242105263158,
        },
        "Nakhon Ratchasima": {
            "name": "นครราชสีมา",
            "lat": 15.083684210526316,
            "long": 102.19768421052632,
        },
        "Nong Bua Lam Phu": {
            "name": "หนองบัวลำภู",
            "lat": 17.179033898305086,
            "long": 102.31191525423728,
        },
        "Nong Khai": {
            "name": "หนองคาย",
            "lat": 17.915338709677417,
            "long": 102.79674193548388,
        },
        "Roi Et": {
            "name": "ร้อยเอ็ด",
            "lat": 15.939567708333334,
            "long": 103.80123958333331,
        },
        "Sakon Nakhon": {"name": "สกลนคร", "lat": 17.398032, "long": 103.829976},
        "Si Sa Ket": {
            "name": "ศรีสะเกษ",
            "lat": 14.93913725490196,
            "long": 104.32834803921568,
        },
        "Surin": {
            "name": "สุรินทร์",
            "lat": 14.93401257861635,
            "long": 103.67064779874217,
        },
        "Ubon Ratchathani": {
            "name": "อุบลราชธานี",
            "lat": 15.274663636363636,
            "long": 105.02341363636364,
        },
        "Udon Thani": {
            "name": "อุดรธานี",
            "lat": 17.40798064516129,
            "long": 102.88775483870968,
        },
        "Yasothon": {
            "name": "ยโสธร",
            "lat": 15.837962025316456,
            "long": 104.30487341772152,
        },
    },
    "central_region": {
        "Ang Thong": {
            "name": "อ่างทอง",
            "lat": 14.613109589041096,
            "long": 100.3824383561644,
        },
        "Bangkok": {
            "name": "กรุงเทพมหานคร",
            "lat": 13.75653896103896,
            "long": 100.55509090909092,
        },
        "Chai Nat": {
            "name": "ชัยนาท",
            "lat": 15.151094339622642,
            "long": 100.07950943396226,
        },
        "Kamphaeng Phet": {
            "name": "กำแพงเพชร",
            "lat": 16.367679487179487,
            "long": 99.6500641025641,
        },
        "Lop Buri": {
            "name": "ลพบุรี",
            "lat": 15.032694214876033,
            "long": 100.80147933884297,
        },
        "Nakhon Nayok": {
            "name": "นครนายก",
            "lat": 14.184071428571428,
            "long": 101.13092857142856,
        },
        "Nakhon Pathom": {
            "name": "นครปฐม",
            "lat": 13.875283018867924,
            "long": 100.1222358490566,
        },
        "Nakhon Sawan": {
            "name": "นครสวรรค์",
            "lat": 15.679092307692308,
            "long": 100.18629230769233,
        },
        "Nonthaburi": {
            "name": "นนทบุรี",
            "lat": 13.892192307692309,
            "long": 100.43184615384617,
        },
        "Pathum Thani": {
            "name": "ปทุมธานี",
            "lat": 14.048133333333334,
            "long": 100.62965,
        },
        "Phetchabun": {
            "name": "เพชรบูรณ์",
            "lat": 16.275517241379312,
            "long": 101.11246551724138,
        },
        "Phichit": {
            "name": "พิจิตร",
            "lat": 16.258280898876407,
            "long": 100.35749438202248,
        },
        "Phitsanulok": {
            "name": "พิษณุโลก",
            "lat": 16.876031914893616,
            "long": 100.38036170212769,
        },
        "Phra Nakhon Si Ayutthaya": {
            "name": "พระนครศรีอยุธยา",
            "lat": 14.373782608695652,
            "long": 100.53191304347826,
        },
        "Samut Prakarn": {"name": "สมุทรปราการ", "lat": 13.61818, "long": 100.65864},
        "Samut Sakhon": {"name": "สมุทรสาคร", "lat": 13.586675, "long": 100.2175},
        "Samut Songkhram": {
            "name": "สมุทรสงคราม",
            "lat": 13.430305555555556,
            "long": 99.95522222222222,
        },
        "Saraburi": {
            "name": "สระบุรี",
            "lat": 14.558211009174313,
            "long": 100.89095412844036,
        },
        "Sing Buri": {
            "name": "สิงห์บุรี",
            "lat": 14.8873488372093,
            "long": 100.35883720930234,
        },
        "Sukhothai": {
            "name": "สุโขทัย",
            "lat": 17.15641860465116,
            "long": 99.79468604651164,
        },
        "Suphan Buri": {
            "name": "สุพรรณบุรี",
            "lat": 14.539688073394496,
            "long": 100.00946788990824,
        },
        "Uthai Thani": {
            "name": "อุทัยธานี",
            "lat": 15.371043478260871,
            "long": 99.79260869565216,
        },
    },
    "eastern_region": {
        "Chachoengsao": {
            "name": "ฉะเชิงเทรา",
            "lat": 13.681526881720432,
            "long": 101.1431935483871,
        },
        "Chanthaburi": {
            "name": "จันทบุรี",
            "lat": 12.683440476190478,
            "long": 102.11432142857142,
        },
        "Chon Buri": {
            "name": "ชลบุรี",
            "lat": 13.154965217391304,
            "long": 101.0667304347826,
        },
        "Prachin Buri": {"name": "ปราจีนบุรี", "lat": 14.0006875, "long": 101.5345},
        "Rayong": {"name": "ระยอง", "lat": 12.776701492537311, "long": 101.418},
        "Sa kaeo": {
            "name": "สระแก้ว",
            "lat": 13.725949152542372,
            "long": 102.33905084745764,
        },
        "Trat": {"name": "ตราด", "lat": 12.114574074074074, "long": 102.49411111111112},
    },
    "western_region": {
        "Kanchanaburi": {
            "name": "กาญจนบุรี",
            "lat": 14.233157894736843,
            "long": 99.43374736842104,
        },
        "Phetchaburi": {
            "name": "เพชรบุรี",
            "lat": 13.044032608695652,
            "long": 99.87514130434784,
        },
        "Prachuap Khiri Khan": {
            "name": "ประจวบคีรีขันธ์",
            "lat": 11.884729166666666,
            "long": 99.66945833333334,
        },
        "Ratchaburi": {"name": "ราชบุรี", "lat": 13.600701923076922, "long": 99.797625},
        "Tak": {"name": "ตาก", "lat": 16.848866666666666, "long": 98.83153333333333},
    },
    "southern_region": {
        "Chumphon": {
            "name": "ชุมพร",
            "lat": 10.337353448275865,
            "long": 99.18531896551724,
        },
        "Krabi": {"name": "กระบี่", "lat": 8.014196428571429, "long": 98.93319642857143},
        "Nakhon Si Thammarat": {
            "name": "นครศรีธรรมราช",
            "lat": 8.347576470588235,
            "long": 99.8606,
        },
        "Narathiwat": {
            "name": "นราธิวาส",
            "lat": 6.231012987012988,
            "long": 101.75083116883116,
        },
        "Pattani": {
            "name": "ปัตตานี",
            "lat": 6.7547565217391305,
            "long": 101.36033913043478,
        },
        "Phang-nga": {
            "name": "พังงา",
            "lat": 8.643742857142858,
            "long": 98.27682857142857,
        },
        "Phatthalung": {
            "name": "พัทลุง",
            "lat": 7.543029850746269,
            "long": 100.06583582089551,
        },
        "Phuket": {"name": "ภูเก็ต", "lat": 7.891435897435898, "long": 98.36633333333332},
        "Ranong": {"name": "ระนอง", "lat": 9.836081967213117, "long": 98.5722950819672},
        "Satun": {"name": "สตูล", "lat": 6.697966292134832, "long": 99.7313595505618},
        "Songkhla": {
            "name": "สงขลา",
            "lat": 7.117035971223022,
            "long": 100.51913669064749,
        },
        "Surat Thani": {
            "name": "สุราษฎร์ธานี",
            "lat": 9.22752879581152,
            "long": 99.40158115183246,
        },
        "Trang": {"name": "ตรัง", "lat": 7.477913043478261, "long": 99.55700869565216},
        "Yala": {"name": "ยะลา", "lat": 6.382275862068966, "long": 101.26344827586206},
    },
}
